Repository: lazezmahrous/seen_chat_app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# language_code
source: en
ar: ar

# appName
source: sean
ar: س

# erordata
source: Field is required
ar: ما ينفعش تسيب هنا فاضي

source: Setting
ar: الإعدادات

source: Language
ar: اللغة

# arLanguage
source: Arabic
ar: اللغة العربية

# enLanguage
source: English
ar: اللغة الإنجليزية

source: Theme
ar: المظهر

source: Dark Theme
ar: داكن

source: Light Theme
ar: فاتح

# welcomePageButton
source: Enter
ar: دخول

# welcome
source: Sello Hearing
ar: سرحباً مهندس

# welcomePageDescription
source: Of course, the sentence above means welcome, but as for 'Hearing', it is a word that starts with the letter that the word 'Hello' starts with. So we removed the letter H and replaced it with S and brought a word that starts with the letter we removed, which is H. So the word will be Hello, and this is the encryption idea on which the application is based.
ar: طبعا الجمله الي فوق دي معناها مرحبا بس أما مهندس فا دي كلمه بتبدأ بالحرف الي بتبدأ بيه كلمه مرحبا ف إحنا شيلنا حرف ال م وبدلناه بي س وجبنا كلمه بتبدأ بالحرف الي شيلناه إلي هوا م ف الكلمه هتبقي مهندس ودي فكره التشفير الي مبني عليها التطبيق

# loginHeadText
source: Login
ar: تسجيل الدخول

# loginEmail
source: Email
ar: الإميل

# loginEmailError
source: Enter the email correctly
ar: إكتب الإميل صح

# loginEmailIsUsedWithAnotherUser
source: The email is already used
ar: الإميل مستخدم قبل كدا

# userNotFound
source: The user has not registered before
ar: المستخدم لم يسجل من قبل

# passwoard
source: Password
ar: كلمة السر

source: Wrong password
ar: كلمة السر غلط

source: Weak Password
ar: الرقم السري ضعيف

source: Email Already In Use
ar: الإميل مستخدم من قبل

# confirmPsswoard
source: Confirm password
ar: قم بتأكيد كلمة السر

# passwoardNotMatch
source: The password does not match
ar: كلمه السر غير مطابقه

# loginPasswoardError
source: Incorrect password
ar: كلمه السر غير صحيحه

# userNotLogin
source: Not registered with us before?
ar: لم تسجل لدينا من قبل ؟

# sighnUpHeadText
source: Sign Up
ar: إنشاء حساب

# loadingSighnUser
source: Creating an account ...
ar: جار إنشاء حساب ...

# sighnUpUserName
source: Username
ar: إسم المستخدم

# wrongUserName
source: Short name
ar: الإسم قصير

source: Spaces are not allowed
ar: مش مسموح بالمسافات

# fieldIsRequired
source: This field cannot be empty
ar: ما ينفعش تسيب هنا فاضي

# userisLogin
source: Already have an account?
ar: عندك حساب بالفعل ؟

source: Wrong
ar: في مشكله

source: Chats Not Found
ar: ماعندكش أي محادثات

# noMessages
source: No Messages Yet !
ar: لم يتم إرسال رسائل حتي الأن

# searchForNewUser
source: Search for users to start fun conversations in the sughah lamp language
ar: بحث عن مستخدمين لبدء محادثات ممتعه بلغة السُغه لمبه

# userIsOnline
source: Online
ar: متصل الأن

source: Last seen from
ar: أخر ظهور من

source: To
ar: إلي

# searchKayWord
source: Search by personal ID
ar: إبحث عن طريق المعرف الشخصي

source: Search For Users
ar: بحث عن مستخدمين

# noUserFound
source: No users found with this ID
ar: لا يوجد مستخدمين بهذا المعرف

# personalId
source: Your personal ID
ar: المعرف الخاص بك

# editUserNameText
source: New name
ar: الإسم الجديد

# userNameIsShort
source: Username is too short
ar: إسم المستخدم قصير

# logOutHeadText
source: Logout confirmation
ar: تأكيد الخروج

# areYouSureLogOut
source: Are you sure you want to log out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج

source: Log out
ar: تسجيل الخروج

source: Cancel
ar: إلغاء

# copySuccess
source: Copied successfully
ar: تم النسخ

# writeMessage
source: What do you want to send?
ar: عايز تبعت إيه

source: Reply
ar: رد

source: Copy
ar: نسخ

source: Delete
ar: حذف

# orignal
source: Original
ar: الأصل

# messageSent
source: Sent
ar: تم الإرسال

# messageSeen
source: Seen
ar: تم المشاهده

source: You
ar: أنت

source: He
ar: هو

# preventScreenShot
source: Prevent screenshot of the conversation
ar: منع أخذ لقطة شاشة للمحادثة

# on
source: Enable
ar: تفعيل

# off
source: Disable
ar: إلغاء التفعيل

# youPreventScreenShot
source: You prevented screenshots of this chat
ar: أنت قمت بمنع أخذ لقطة شاشة لهذه المحادثة

# hePreventScreenShot
source: He prevented screenshots of this chat
ar: هو قام بمنع أخذ لقطة شاشة لهذه المحادثة

# harfOfEncryption
source: The letter to be replaced in encryption
ar: الحرف إلي هيستبدل في التشفير

source: Chat settings
ar: إعدادات المحادثة

# loading
source: Sending
ar: جار الإرسال

# loadingFailure
source: Sending failed
ar: فشل الإرسال

# failure
source: Unexpected error
ar: خطأ غير متوقع

source: Writing ...
ar: يكتب ...

# trySendingAgain
source: Try again
ar: إرسال مره تانيه

# replyedSuccess
source: Replied
ar: تم الرد

# replyedImage
source: Replied: Image
ar: تم الرد : صوره

# replyedVoic
source: Replied: Voice message
ar: تم الرد : رساله صوتيه

# sendingVoice
source: Voice message sent
ar: تم إرسال رساله صوتيه

# sendingImage
source: Image sent
ar: تم إرسال صوره

source: Discovering
ar: استكتشاف

# soundMessage
source: Voice note
ar: المقطع الصوتي

source: block
ar: حظر

source: Delete Message Failure
ar: حدث خطأ أثناء حذف الرساله
